namespace Dictionary_Lab;

class Program
{
    static void GetAnswer()
    {
        // Словарь хранящий пары страна - столица и столица - страна для двустороннего действия программы
        Dictionary<string, string> capitalsAndCountries = new Dictionary<string, string>()
        {
            ["россия"] = "москва",
            ["нидерланды"] = "амстердам",
            ["греция"] = "афины",
            ["сербия"] = "белград",
            ["германия"] = "берлин",
            ["швейцария"] = "берн",
            ["словакия"] = "братислава",
            ["бельгия"] = "брюссель",
            ["венгрия"] = "будапешт",
            ["румыния"] = "бухарест",
            ["мальта"] = "валлетта",
            ["польша"] = "варшава",
            ["австрия"] = "вена",
            ["литва"] = "вильнюс",
            ["ирландия"] = "дублин",
            ["молдова"] = "кишинёв",
            ["турция"] = "анкара",
            ["казахстан"] = "астана",
            ["сирия"] = "дамаск",
            ["индонезия"] = "джакарта",
            ["филиппины"] = "манила",
            ["оман"] = "маскат",
            ["саудовская аравия"] = "эр-рияд",
            ["москва"] = "россия",
            ["амстердам"] = "нидерланды",
            ["афины"] = "греция",
            ["белград"] = "сербия",
            ["берлин"] = "германия",
            ["берн"] = "швейцария",
            ["братислава"] = "словакия",
            ["брюссель"] = "бельгия",
            ["будапешт"] = "венгрия",
            ["бухарест"] = "румыния",
            ["валлетта"] = "мальта",
            ["варшава"] = "польша",
            ["вена"] = "австрия",
            ["вильнюс"] = "литва",
            ["дублин"] = "ирландия",
            ["кишинёв"] = "молдова",
            ["анкара"] = "турция",
            ["астана"] = "казахстан",
            ["дамаск"] = "сирия",
            ["джакарта"] = "индонезия",
            ["манила"] = "филиппины",
            ["маскат"] = "оман",
            ["эр-рияд"] = "саудовская аравия"
        };
        
        // Бесконечный цикл для лучшего пользовательског опыта
        while (true)
        {
            Console.WriteLine("--- Введите название страны или её столицу ---");
            Console.WriteLine("---------- Для выхода введите ВЫХОД ----------");
            var userInput = Console.ReadLine();
            // Проверка на наличие введенной страны/столицы в словаре и последующий вывод
            if (userInput != null && capitalsAndCountries.TryGetValue(userInput.ToLower(), out var result))
            {
                Console.ForegroundColor = ConsoleColor.Magenta;
                Console.WriteLine(result[0].ToString().ToUpper() + result.Substring(1));
                Console.ResetColor();
            }
            
            // Возможность для выхода из программы
            else if (userInput != null && userInput.ToLower() == "выход")
            {
                Console.WriteLine("Выход из программы, нажмите любую клавишу, чтобы закрыть программу...");
                Console.ReadKey();
                break;
            }
            
            // Вывод ошибки для того, чтобы пользователь сделал новую попытку
            else
            {
                Console.ForegroundColor = ConsoleColor.Yellow;
                Console.WriteLine("Страна/Столица не найдена в текущей базе данных");
                Console.ResetColor();   
            }
            Console.WriteLine();
        }
    }
    static void Main()
    {
        // Установка кодировки для возможности ввода и вывода в консоль на русском языке
        Console.InputEncoding = System.Text.Encoding.UTF8;
        Console.OutputEncoding = System.Text.Encoding.UTF8;
        GetAnswer();
    }
}